OdTextProperties.setSetTriangleCache(System.Boolean)
\details
Controls the kTringleCache flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isTriangleCache
\details
Returns true if and only if the kTringleCache flag is set for this TextProperties object.

OdTextProperties.setTextQuality(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Returns the text quality percent for this vectorization process.
\remarks
Sets a value in the range [0,100]. 50 is the default.

OdTextProperties.textQuality
\details
Returns the text quality percent for this vectorization process.
\returns
Returns a value in the range [0,100]. 50 is the default.

OdTextProperties.setTrackingPercent(System.Double)
\details
Sets the tracking percent for this TextProperties object.
\param trackingPercent [in]  Tracking percent.

OdTextProperties.trackingPercent
\details
Returns the tracking percent for this TextProperties object.

OdTextProperties.setTtfPolyDraw(System.Boolean)
\details
Sets smooth TTF text contour output flag.
bFlag (in) New flag value.

OdTextProperties.ttfPolyDraw
\details
Returns smooth TTF text contour output flag.

OdTextProperties.setZeroNormals(System.Boolean)
\details
Controls the kZeroNormals flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isZeroNormals
\details
Returns true if and only if the ZeroNormals flag is set for this TextProperties object.

OdTextProperties.setIncludePenups(System.Boolean)
\details
Controls the IncludePenups flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isIncludePenups
\details
Returns true if and only if the IncludePenups flag is set for this TextProperties object.

OdTextProperties.setInBigFont(System.Boolean)
\details
Controls the InBigFont flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isInBigFont
\details
Returns true if and only if the InBigFont flag is set for this TextProperties object.

OdTextProperties.setLastChar(System.Boolean)
\details
Controls the LastChar flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isLastChar
\details
Returns true if and only if the LastChar flag is set for this TextProperties object.
\details
Returns true if and only if the LastChar flag is set for this TextProperties object.

OdTextProperties.setStriked(System.Boolean)
\details
Controls the Striked flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isStriked
\details
Returns true if and only if the Striked flag is set for this TextProperties object.

OdTextProperties.setOverlined(System.Boolean)
\details
Controls the Overlined flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isOverlined
\details
Returns true if and only if the Overlined flag is set for this TextProperties object.

OdTextProperties.setUnderlined(System.Boolean)
\details
Controls the Underlined flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isUnderlined
\details
Returns true if and only if the Underlined flag is set for this TextProperties object.

OdTextProperties.setVerticalText(System.Boolean)
\details
Controls the Vertical Text flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isVerticalText
\details
Returns true if and only if the Vertical Text flag is set for this TextProperties object.

OdTextProperties.setNormalText(System.Boolean)
\details
Controls the Normal Text flag for this TextProperties object.
\param value [in]  Controls the flag.

OdTextProperties.isNormalText
\details
Returns true if and only if the Normal Text flag is set for this TextProperties object.